# coding: utf-8

# Easy

# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Подсказка: воспользоваться методом .format()

title = 'Добро пожаловать в программу на Python!'
print(title)

print('Привет программист!')
name = input("Ваше имя: ")

print('Здравствуйте ' + name + ", добро пожаловать!")
input()