# coding: utf-8

# Easy

# Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке.

print('Здравствуйте!')

number = int(input("Введите число: "))

print(number + 2)
input()